mysource/public-notes-org/2024-01-25-own-latex-packages-in-miktex.org
#+TITLE: own-latex-packages-in-miktex
#+DESCRIPTION: 
#+AUTHOR: cissic 
#+DATE: <2024-01-25 Thu>
#+TAGS: debian linux latex miktex packages texmf
#+OPTIONS: -:nil

* TODO own-latex-packages-in-miktex
:PROPERTIES:
:PRJ-DIR: ./2024-01-25-own-latex-packages-in-miktex/
:END:

** Problem description
There is a directory =~/texmf= which contains tex directory tree
structure. In order to have it usable withing =miktex= distribution
you need to
- run =miktex-console=,
- choose =Settings= -> =Directories=
- add the path to the directory to =TEXMF root directories=.
- Then it may be necessary to run
  =Tasks -> Refresh file name database=

and voila!
Now your style files and other packages should be accesible by
=miktex=.


#+begin_src org :tangle (concat (org-entry-get nil "PRJ-DIR" t) "script.org") :mkdirp yes :exports none :results none

#+end_src

** Links:
- https://tex.stackexchange.com/questions/73016/how-do-i-install-an-individual-package-on-a-linux-system
- https://tex.stackexchange.com/questions/2063/how-can-i-manually-install-a-package-on-miktex-windows
- https://tex.stackexchange.com/questions/1137/where-do-i-place-my-own-sty-or-cls-files-to-make-them-available-to-all-my-te
